terminal_hello_string = f'{"*" * 100}\nТерминал управления задачами\nУчетная запись № 000-217/2F'
start_terminal_query = 'Выберите дальнейшее действие введя цифру:'
start_terminal_action = ['1. Вывести текущий список задач',
                         '2. Добавить новую задачу в текущий список',
                         '3. Снять задачу с контроля (отметка о выполнении)',
                         '4. Удалить задачу из текущего списка (отменить нельзя)',
                         '5. Импортировать список задач (добавление в текущий список)',
                         '6. Экспортировать список задач (файл будет перезаписан)',
                         '7. Завершить работу']
